EdwarDu/STM32-NRF24-Arduino/USER/eMPL/inv_mpu.c
    #define AKM_DATA_READY      (0x01)
    #define AKM_DATA_OVERRUN    (0x02)
    #define AKM_OVERFLOW        (0x80)
    #define AKM_DATA_ERROR      (0x40)

    #define AKM_BIT_SELF_TEST   (0x40)

    #define AKM_POWER_DOWN          (0x00 | SUPPORTS_AK89xx_HIGH_SENS)
    #define AKM_SINGLE_MEASUREMENT  (0x01 | SUPPORTS_AK89xx_HIGH_SENS)
    #define AKM_FUSE_ROM_ACCESS     (0x0F | SUPPORTS_AK89xx_HIGH_SENS)
    #define AKM_MODE_SELF_TEST      (0x08 | SUPPORTS_AK89xx_HIGH_SENS)

    #define AKM_WHOAMI      (0x48)
#elif defined HMC5883L_SECONDARY
    #define HMC_I2C_ADDR                (0x1E)
    #define HMC_REG_CFG_A               (0x00)
    #define HMC_AVG_SAMPLES_1           0x00    // 1 (Default)
    #define HMC_AVG_SAMPLES_2           0x20    // 2
    #define HMC_AVG_SAMPLES_4           0x40    // 4
    #define HMC_AVG_SAMPLES_8           0x60    // 8

    #define HMC_DO_RATE_0               0x00   // 0.75Hz
    #define HMC_DO_RATE_1               0x04   // 1.5Hz
    #define HMC_DO_RATE_2               0x08   // 3Hz
    #define HMC_DO_RATE_3               0x0C   // 7.5Hz
    #define HMC_DO_RATE_4               0x10   // 15Hz (Default)
    #define HMC_DO_RATE_5               0x14   // 30Hz
    #define HMC_DO_RATE_6               0x18   // 75Hz
    
    #define HMC_MM_0                    0x00    // Normal Measurement Mode (Default)
    #define HMC_MM_1                    0x01    // Positive bias configuration for XYZ axes
    #define HMC_MM_2                    0x02    // Negative bias configuration for XYZ axes

    #define HMC_REG_CFG_B               (0x01)
                                            // Recommended Sensor Field Range      Gain (LSb/Gauss)         Digital Resol(mG/LSb)       Output Range
    #define HMC_GAIN_0                  0x00    // +/- 0.88Ga                           1370                        0.73                    (-2048-2047) (0xF800 - 0x07FF)
    #define HMC_GAIN_1                  0x20    // +/- 1.3Ga                            1090(Default)               0.92                    (-2048-2047) (0xF800 - 0x07FF)
    #define HMC_GAIN_2                  0x40    // +/- 1.9Ga                            820                         1.22                    (-2048-2047) (0xF800 - 0x07FF)
    #define HMC_GAIN_3                  0x60    // +/- 2.5Ga                            660                         1.52                    (-2048-2047) (0xF800 - 0x07FF)
    #define HMC_GAIN_4                  0x80    // +/- 4.0Ga                            440                         2.27                    (-2048-2047) (0xF800 - 0x07FF)
    #define HMC_GAIN_5                  0xA0    // +/- 4.7Ga                            390                         2.56                    (-2048-2047) (0xF800 - 0x07FF)
    #define HMC_GAIN_6                  0xC0    // +/- 5.6Ga                            330                         3.03                    (-2048-2047) (0xF800 - 0x07FF)
    #define HMC_GAIN_7                  0xE0    // +/- 8.1Ga                            230                         4.35                    (-2048-2047) (0xF800 - 0x07FF)

    #define HMC_REG_MODE                (0x02)
    #define HMC_I2C_HS_ENABLE           0x80    // 3400kHz I2C
    #define HMC_OP_MODE_CONTINOUS       0x00    // Continous-Measuremnt Mode.
    #define HMC_OP_MODE_SINGLE          0x01    // Single-Measuremnt Mode.
    #define HMC_OP_MODE_IDLE            0x03    // Device is placed in idle mode

    #define HMC_REG_X_H                 (0x03)
    #define HMC_REG_X_L                 (0x04)
    #define HMC_REG_Z_H                 (0x05)
    #define HMC_REG_Z_L                 (0x06)
    #define HMC_REG_Y_H                 (0x07)
    #define HMC_REG_Y_L                 (0x08)

    #define HMC_REG_STATUS              (0x09)
    #define HMC_IS_LOCKED(x)            (x&0x02)
    #define HMC_IS_DRDY(x)              (x&0x01)

    #define HMC_REG_WHOAMI_1            (0x0A)
    #define HMC_REG_WHOAMI_2            (0x0B)
    #define HMC_REG_WHOAMI_3            (0x0C)

    #define HMC_IAM1                    0x48
    #define HMC_IAM2                    0x34
    #define HMC_IAM3                    0x33
#endif

#if defined MPU6050
const struct gyro_reg_s reg = {
	/* .who_am_i       = */ 0x75,
    /* .rate_div       = */ 0x19,
    /* .lpf            = */ 0x1A,
    /* .prod_id        = */ 0x0C,
    /* .user_ctrl      = */ 0x6A,
    /* .fifo_en        = */ 0x23,
    /* .gyro_cfg       = */ 0x1B,
    /* .accel_cfg      = */ 0x1C,
	/*  accel_cfg2     = */ 0xFF,   // not used by MPU6050
	/*  lp_accel_odr   = */ 0xFF,   // not used by MPU6050
    /* .motion_thr     = */ 0x1F,
    /* .motion_dur     = */ 0x20,
    /* .fifo_count_h   = */ 0x72,
    /* .fifo_r_w       = */ 0x74,
    /* .raw_gyro       = */ 0x43,
    /* .raw_accel      = */ 0x3B,
    /* .temp           = */ 0x41,
    /* .int_enable     = */ 0x38,
    /* .dmp_int_status = */ 0x39,
    /* .int_status     = */ 0x3A,
    /*  accel_intel    = */ 0xFF,  // not used by MPU6050
	/* .pwr_mgmt_1     = */ 0x6B,
    /* .pwr_mgmt_2     = */ 0x6C,
    /* .int_pin_cfg    = */ 0x37,
    /* .mem_r_w        = */ 0x6F,
    /* .accel_offs     = */ 0x06,
    /* .i2c_mst        = */ 0x24,
    /* .bank_sel       = */ 0x6D,
    /* .mem_start_addr = */ 0x6E,
    /* .prgm_start_h   = */ 0x70
#if defined AK89xx_SECONDARY || defined HMC5883L_SECONDARY
    ,
    /* .s0_addr        = */ 0x25,
    /* .s0_reg         = */ 0x26,
    /* .s0_ctrl        = */ 0x27,
    /* .s1_addr        = */ 0x28,
    /* .s1_reg         = */ 0x29,
    /* .s1_ctrl        = */ 0x2A,
    /* .s4_ctrl        = */ 0x34,
    /* .s0_do          = */ 0x63,
    /* .s1_do          = */ 0x64,
    /* .i2c_delay_ctrl = */ 0x67,
	/* .raw_compass    = */ 0x49,
    /* .yg_offs_tc     = */ 0x01
#endif
};
const struct hw_s hw = {
    /* .addr           = */ 0x68,
    /* .max_fifo       = */ 1024,
    /* .num_reg        = */ 118,
    /* .temp_sens      = */ 340,
    /* .temp_offset    = */ -521,
    /* .bank_size      = */ 256
#if defined AK89xx_SECONDARY
    ,
    /*.compass_fsr    =  */ AK89xx_FSR
#elif defined HMC5883L_SECONDARY
    ,
    /*.compass_fsr    =  */ HMC5883L_FSR
#endif
};

